function init () {
	// 用户管理、拍照添加新用户、选择用户、记盘（发球与零点的角度）
	// lzr_tools.trace();
}

var dat = {
	// p: [0,32,15,19,4,21,2,25,17,34,6,27,13,36,11,30,8,23,10,5,24,16,33,1,20,14,31,9,22,18,29,7,28,12,35,3,26],
	p: [0,23,6,35,4,19,10,31,16,27,18,25,33,12,14,2,21,8,29,3,24,5,28,17,20,7,36,11,32,30,15,26,1,22,9,34,13],
	u: "",
	v: [],
	pp: 0,

	// 计算b相对于a的位置
	calP: function (a, b) {
		var p = dat.p[b] - dat.p[a];
		if (p < -18) {
			p += 37;
		} else if (p > 18) {
			p -= 37;
		}
		return p;
	},

	setV: function (v) {
		if (v) {
			// v -= 0;
			if (v > -1 && v < 37) {
				console.log(dat.calP(dat.pp, v));
				dat.pp = v;
				vDoe.value = "";
			}
		}
	},
};
